doc/json-from-postgres.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-07-18 Sun 09:21 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Json From Postgresql/Postmodern</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Sabra Crolleton">
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Json From Postgresql/Postmodern</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb72468a">Intro</a></li>
<li><a href="#sql-version">The Basic SQL Version</a></li>
<li><a href="#s-sql-version">The Basic S-SQL Version</a></li>
<li><a href="#dao-class-version">The Basic Dao-class Version</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgb72468a" class="outline-2">
<h2 id="orgb72468a">Intro</h2>
<div class="outline-text-2" id="text-orgb72468a">
<p>
Suppose the front end of an app needs data as a json string and you need to get the data out of a database and convert it to that format. There are several ways to do that. We will look at doing it with basic sql, s-sql and a dao class. For purposes of this note, we are not looking at jsonb type columns in Postgresql.
</p>

<p>
To make things a little more interesting, we are going to have a private column which we do not want to pass to the front-end, a Postgresql point datatype column and we will have a geometry type (using postgis) to compare that to the point type. If you do not have postgis installed, you can find installation instruction here: <a href="https://postgis.net/install/">https://postgis.net/install/</a> or just read the the postgis stuff without trying to run the code.
</p>

<p>
I am going to use the local-time library to deal with dates, so we need to do a little housework on that side as well.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(ql:quickload '(local-time cl-postgres+local-time))
(local-time:set-local-time-cl-postgres-readers)
</pre>
</div>
</div>
</div>
