doc/json-from-postgres.html

<div id="outline-container-sql-version" class="outline-2">
<h2 id="sql-version">The Basic SQL Version</h2>
<div class="outline-text-2" id="text-sql-version">
<p>
Assuming you already have a database to use, let's create a couple of tables and insert some data.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(pomo:query <span style="color: #e67128;">"CREATE TABLE departments (</span>
<span style="color: #e67128;">      department_id bigint primary key,</span>
<span style="color: #e67128;">      name text</span>
<span style="color: #e67128;">      )"</span>)

(pomo:query <span style="color: #e67128;">"CREATE TABLE employees (</span>
<span style="color: #e67128;">        employee_id serial primary key,</span>
<span style="color: #e67128;">        department_id integer references departments(department_id),</span>
<span style="color: #e67128;">        name text,</span>
<span style="color: #e67128;">        start_date date,</span>
<span style="color: #e67128;">        contact text[],</span>
<span style="color: #e67128;">        private text,</span>
<span style="color: #e67128;">        lat_long point,</span>
<span style="color: #e67128;">        geom geometry(point, 4326)json-from-p</span>
<span style="color: #e67128;">        );"</span>)

(pomo:query <span style="color: #e67128;">"INSERT INTO departments</span>
<span style="color: #e67128;">   (department_id, name)</span>
<span style="color: #e67128;">  VALUES</span>
<span style="color: #e67128;">   (1, 'spatial'),</span>
<span style="color: #e67128;">   (2, 'cloud')"</span>)

(pomo:query <span style="color: #e67128;">"INSERT INTO employees</span>
<span style="color: #e67128;"> (department_id, name, start_date, contact, private, lat_long, geom)</span>
<span style="color: #e67128;">VALUES</span>
<span style="color: #e67128;"> (1, 'Maja',   '2018/09/02', '{"</span>084-767-734<span style="color: #e67128;">","</span>071-334-8473<span style="color: #e67128;">"}', 'not allowed',</span>
<span style="color: #e67128;"> '(59.334591, 18.063240)', 'POINT(59.334591 18.063240)'),</span>
<span style="color: #e67128;"> (1, 'Liam', '2019/09/02', '{"</span>084-767-734<span style="color: #e67128;">","</span>071-334-8472<span style="color: #e67128;">"}','private',</span>
<span style="color: #e67128;"> '(57.708870, 11.974560)','POINT(57.708870 11.974560)'),</span>
<span style="color: #e67128;"> (2, 'Matteo',  '2019/11/01', '{"</span>084-767-734<span style="color: #e67128;">","</span>071-334-8476<span style="color: #e67128;">"}', 'burn before reading',</span>
<span style="color: #e67128;">   '(58.283489,12.285821)','POINT(58.283489 12.285821)'),</span>
<span style="color: #e67128;"> (2, 'Astrid',    '2020/10/01',  '{"</span>084-767-734<span style="color: #e67128;">","</span>071-334-8465<span style="color: #e67128;">"}', 'abandon all hope',</span>
<span style="color: #e67128;">  '(57.751442, 16.628838)', 'POINT(57.751442 16.628838)');"</span>)
</pre>
</div>
<p>
One difference to note is that the data for the lat_long point data type has a comma, but the geom geometry data type does not have a comma. No, I do not know why the syntax difference.
</p>

<p>
I want to flag something that can surprise people. The lat_long column is a Postgresql point datatype. That means it is an array. As you may recall, Postgresql arrays start at 1, not 0. Except here. If you wanted just the latitude for the row with the employee_id of 1, you would actually call for array 0.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(pomo:query <span style="color: #e67128;">"select lat_long[0] from employees where employee_id=1"</span> <span style="color: #23d7d7;">:single</span>)
59.334591d0
</pre>
</div>
<p>
If you wanted to get the latitude and longitude in a list, it would look like:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(pomo:query <span style="color: #e67128;">"select lat_long[0], lat_long[1] from employees where employee_id=1"</span>)
((59.334591d0 18.06324d0))
</pre>
</div>

<p>
If you ran a basic query to see how Postgresql was storing that geometry type, it would look something like this:
</p>

<div class="org-src-container">
<pre class="src src-lisp">  (pomo:query <span style="color: #e67128;">"select geom from employees where employee_id=1"</span> <span style="color: #23d7d7;">:single</span>)
<span style="color: #e67128;">"0101000020E61000009A44BDE0D3AA4D408ECC237F30103240"</span>
</pre>
</div>
<p>
To actually get the separate latitude and longitude from the geom column, you need to use Postgresql functions st_x and st_y like so:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select st_x(geom), st_y(geom) from employees where employee_id=1"</span>)
((59.334591d0 18.06324d0))
</pre>
</div>

<p>
Now on to getting this information as json. Postgresql gives you a json generator function that takes a tuple and returns a json dictionary. So, for example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select row_to_json(employees) from employees where employee_id=1"</span>)
((<span style="color: #e67128;">"{\"employee_id\":1,</span>
<span style="color: #e67128;">    \"department_id\":1,</span>
<span style="color: #e67128;">    \"name\":\"Maja\",</span>
<span style="color: #e67128;">    \"start_date\":\"2018-09-02\",</span>
<span style="color: #e67128;">    \"contact\":[\"084-767-734\",\"071-334-8473\"],</span>
<span style="color: #e67128;">    \"private\":\"not allowed\",</span>
<span style="color: #e67128;">    \"lat_long\":\"(59.334591,18.06324)\",</span>
<span style="color: #e67128;">    \"geom\":{\"type\":\"Point\",\"coordinates\":[59.334591,18.06324]}}"</span>))
</pre>
</div>
<p>
You can see that it would automatically break out the geom data. However, as written, it has the fatal flaw of also collecting the private info. That can get solved with a slight modification:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select row_to_json(e)</span>
<span style="color: #e67128;">        from</span>
<span style="color: #e67128;">          (select employee_id, department_id, name, start_date, contact, lat_long, geom</span>
<span style="color: #e67128;">           from employees where employee_id=1) e"</span>)
((<span style="color: #e67128;">"{\"employee_id\":1,</span>
<span style="color: #e67128;"> \"department_id\":1,</span>
<span style="color: #e67128;"> \"name\":\"Maja\",</span>
<span style="color: #e67128;"> \"start_date\":\"2018-09-02\",</span>
<span style="color: #e67128;"> \"contact\":[\"084-767-734\",\"071-334-8473\"],</span>
<span style="color: #e67128;"> \"lat_long\":\"(59.334591,18.06324)\",</span>
<span style="color: #e67128;"> \"geom\":{\"type\":\"Point\",\"coordinates\":[59.334591,18.06324]}}"</span>))
</pre>
</div>
<p>
You can also aggregate rows using the Postgresql json_agg function.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select json_agg(e)</span>
<span style="color: #e67128;">        from</span>
<span style="color: #e67128;">          (select employee_id, department_id, name, start_date, contact, lat_long, geom</span>
<span style="color: #e67128;">           from employees)</span>
<span style="color: #e67128;">        e"</span>)
</pre>
</div>
<p>
You could skip the Postgresql json function and ask Postmodern to return the query as a json object expressed as a string. One thing to note is that Postmodern will return the labels as camelCase rather than Postgresql returning them as underscores:
</p>
<div class="org-src-container">
<pre class="src src-lisp"> (query <span style="color: #e67128;">"select employee_id, department_id, name, start_date, contact, lat_long, geom</span>
<span style="color: #e67128;">         from employees</span>
<span style="color: #e67128;">         where employee_id=1"</span>
        <span style="color: #23d7d7;">:json-str</span>)
<span style="color: #e67128;">"{\"employeeId\":1,\"departmentId\":1,\"name\":\"Maja\",\"startDate\":\"{2018-09-01T20:00:00.000000-04:00}\",\"contact\":[\"084-767-734\",\"071-334-8473\"],\"latLong\":[59.334591,18.06324],\"geom\":\"0101000020E61000009A44BDE0D3AA4D408ECC237F30103240\"}"</span>
</pre>
</div>
<p>
You would need to do a little more work in order to get the desired latitude and longitude out of the geom value.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select employee_id, department_id, name, start_date, contact, lat_long, st_x(geom) as lat, st_y(geom) as long</span>
<span style="color: #e67128;">             from employees where employee_id=1"</span> <span style="color: #23d7d7;">:json-str</span>)

<span style="color: #e67128;">"{\"employeeId\":1,\"departmentId\":1,\"name\":\"Maja\",\"startDate\":\"{2018-09-01T20:00:00.000000-04:00}\",\"contact\":[\"084-767-734\",\"071-334-8473\"],\"latLong\":[59.334591,18.06324],\"lat\":59.334591,\"long\":18.06324}"</span>
</pre>
</div>
<p>
Both the Postgresql function and the Postmodern return type approach can be applied to the end result of more complicated queries with joins, CTEs and other tools of the trade. Which is actually why we have the department table in this example. Instead of having the department-id in the json we are sending to the front end, let's have the department name.
</p>

<p>
First the using the Postgresql <code>row-to-json</code> function:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select row_to_json(e)</span>
<span style="color: #e67128;">        from  (select employee_id, departments.name as department_name, employees.name as employee_name,</span>
<span style="color: #e67128;">                      start_date, contact, lat_long, geom</span>
<span style="color: #e67128;">               from employees</span>
<span style="color: #e67128;">               left join departments</span>
<span style="color: #e67128;">               on departments.department_id = employees.department_id</span>
<span style="color: #e67128;">               where employee_id=1) e"</span>)
((<span style="color: #e67128;">"{\"employee_id\":1,\"department_name\":\"spatial\",\"employee_name\":\"Maja\",\"start_date\":\"2018-09-02\",\"contact\":[\"084-767-734\",\"071-334-8473\"],\"lat_long\":\"(59.334591,18.06324)\",\"geom\":{\"type\":\"Point\",\"coordinates\":[59.334591,18.06324]}}"</span>))
</pre>
</div>
<p>
Now the sql using the Postmodern :json-str keyword parameter for query:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span style="color: #e67128;">"select employee_id, departments.name as department_name, employees.name as employee_name,</span>
<span style="color: #e67128;">               start_date, contact, lat_long, geom</span>
<span style="color: #e67128;">        from employees</span>
<span style="color: #e67128;">        left join departments</span>
<span style="color: #e67128;">        on departments.department_id = employees.department_id</span>
<span style="color: #e67128;">        where employee_id=1"</span>
     <span style="color: #23d7d7;">:json-str</span>))
<span style="color: #e67128;">"{\"employeeId\":1,\"departmentName\":\"spatial\",\"employeeName\":\"Maja\",\"startDate\":\"{2018-09-01T20:00:00.000000-04:00}\",\"contact\":[\"084-767-734\",\"071-334-8473\"],\"latLong\":[59.334591,18.06324],\"geom\":\"0101000020E61000009A44BDE0D3AA4D408ECC237F30103240\"}"</span>
</pre>
</div>
</div>
</div>
