doc/json-from-postgres.org
* The Basic S-SQL Version
:PROPERTIES:
:CUSTOM_ID: s-sql-version
:END:
Assuming you already have a database to use, let's create a couple of tables and insert some data.
#+begin_src lisp
  (pomo:query (:create-table 'departments
                             ((department-id :type (or pomo:db-null bigint) :primary-key t)
                              (name :type (or pomo:db-null text)))))

  (pomo:query (:create-table employees
                             ((employee_id :type serial :primary-key t)
                              (department_id :type (or pomo:db-null integer) :references ((departments department_id)))
                              (name :type (or pomo:db-null text))
                              (start_date :type (or pomo:db-null date))
                              (contact :type (or pomo:db-null text[]))
                              (private :type (or pomo:db-null text))
                              (lat_long :type (or pomo:db-null point))
                              (geom :type (or pomo:db-null (geometry point 4326))))))

  (pomo:query (:insert-rows-into 'departments
               :columns 'deparment-id 'name
               :values '((1 "spatial") (2 "cloud"))))

(pomo:sql (:insert-rows-into 'employees
               :columns 'department-id 'name 'start-date 'contact 'private 'lat_long 'geom
               :values
         '((1 "Maja"   "2018/09/02" #("084-767-734""071-334-8473") "not allowed"
         "(59.334591, 18.063240)" "POINT(59.334591 18.063240)")
         (1 "Liam" "2019/09/02" #("084-767-734" "071-334-8472") "private"
         "(57.708870, 11.974560)" "POINT(57.708870 11.974560)")
         (2 "Matteo"  "2019/11/01" #("084-767-734""071-334-8476") "burn before reading"
            "(58.28348912.285821)" "POINT(58.283489 12.285821)")
         (2 "Astrid"    "2020/10/01"  #("084-767-734""071-334-8465") "abandon all hope"
            "(57.751442, 16.628838)" "POINT(57.751442 16.628838)"))))
#+end_src
One difference to note is that the data for the lat_long point data type has a comma, but the geom geometry data type does not have a comma. No, I do not know why the syntax difference in Postgresql (Postmodern needs it to properly match Postgresql's syntax here).

I want to flag something that can surprise people. The lat_long column is a Postgresql point datatype. That means it is an array. As you may recall, Postgresql arrays start at 1, not 0. Except here. If you wanted just the latitude for the row with the employee_id of 1, you would actually call for array 0.
#+begin_src lisp
(pomo:query (:select (:[] 'lat_long 0) :from 'employees :where (:= 'employee_id 1)) :single)
59.334591d0
#+end_src
If you wanted the latitude and longitude in alist, the query would look like:
#+begin_src lisp
  (pomo:query (:select (:[] 'lat_long 0) (:[] 'lat_long 1) :from 'employees :where (:= 'employee_id 1)))
  ((59.334591d0 18.06324d0))
#+end_src
If you ran a basic query to see how Postgresql was storing that geometry type, it would look something like this:
#+begin_src lisp
  (pomo:query (:select 'geom :from 'employees :where (:= 'employee-id 1)) :single)
    "0101000020E61000009A44BDE0D3AA4D408ECC237F30103240"
#+end_src
To actually get the separate latitude and longitude from the geom column, you need to use Postgresql functions st_x and st_y like so:
#+begin_src lisp
(with-connection *dba-connection* (query (:select (:st-x 'geom) (:st-y 'geom) :from 'employees :where (:= 'employee_id 1))))
((59.334591d0 18.06324d0))
#+end_src
Now on to getting this information as json. Postgresql gives you a json generator function that takes a tuple and returns a json dictionary. So, for example:
#+begin_src lisp
(pomo:query (:select (:row-to-json 'employees) :from 'employees :where (:= 'employee-id 1)))
  (("{\"employee_id\":1,
      \"department_id\":1,
      \"name\":\"Maja\",
      \"start_date\":\"2018-09-02\",
      \"contact\":[\"084-767-734\",\"071-334-8473\"],
      \"private\":\"not allowed\",
      \"lat_long\":\"(59.334591,18.06324)\",
      \"geom\":{\"type\":\"Point\",\"coordinates\":[59.334591,18.06324]}}"))
#+end_src
You can see that it would automatically break out the geom data. However, as written, it has the fatal flaw of also collecting the private info. That can get solved with a slight modification:
#+begin_src lisp
  (query (:select (:row-to-json 'e)
          :from (:as (:select 'employee-id 'department-id 'name 'start-date 'contact
                              'lat-long 'geom
                      :from 'employees
                      :where (:= 'employee-id 1))
                     'e)))
  (("{\"employee_id\":1,
     \"department_id\":1,
     \"name\":\"Maja\",
     \"start_date\":\"2018-09-02\",
     \"contact\":[\"084-767-734\",\"071-334-8473\"],
     \"lat_long\":\"(59.334591,18.06324)\",
     \"geom\":{\"type\":\"Point\",\"coordinates\":[59.334591,18.06324]}}"))
#+end_src
You can also aggregate rows using the Postgresql json_agg function.
#+begin_src lisp
  (query (:select (:json-agg 'e)
          :from (:as (:select 'employee-id 'department-id 'name 'start-date 'contact
                              'lat-long 'geom
                      :from 'employees)
                     'e)))
#+end_src
You could skip the Postgresql json function and ask Postmodern to return the query as a json object expressed as a string. One thing to note is that Postmodern will return the labels as camelCase rather than Postgresql returning them as underscores:
#+begin_src lisp
  (query (:select 'employee-id 'department-id 'name 'start-date 'contact 'lat-long 'geom
          :from 'employees
          :where (:= 'employee-id 1)) :json-str)

"{\"employeeId\":1,\"departmentId\":1,\"name\":\"Maja\",\"startDate\":\"{2018-09-01T20:00:00.000000-04:00}\",\"contact\":[\"084-767-734\",\"071-334-8473\"],\"latLong\":[59.334591,18.06324],\"geom\":\"0101000020E61000009A44BDE0D3AA4D408ECC237F30103240\"}"
#+end_src
You would need to do a little more work in order to get the desired latitude and longitude out of the geom value.
#+begin_src lisp
  (query (:select 'employee-id 'department-id 'name 'start-date 'contact 'lat-long
                  (:st-x 'geom) (:st-y 'geom)
                  :from 'employees
                  :where (:= 'employee-id 1))
         :json-str)
  "{\"employeeId\":1,\"departmentId\":1,\"name\":\"Maja\",\"startDate\":\"{2018-09-01T20:00:00.000000-04:00}\",\"contact\":[\"084-767-734\",\"071-334-8473\"],\"latLong\":[59.334591,18.06324],\"stX\":59.334591,\"stY\":18.06324}"
#+end_src
Both the Postgresql function and the Postmodern return type approach can be applied to the end result of more complicated queries with joins, CTEs and other tools of the trade. Which is actually why we have the department table in this example. Instead of having the department-id in the json we are sending to the front end, let's have the department name.

First the s-sql using the Postgresql =row-to-json= function:
#+begin_src lisp
  (query (:select (:row-to-json 'e)
          :from (:as (:select 'employee-id (:as 'departments.name 'department_name)
                              (:as 'employees.name 'employee-name)
                              'start-date 'contact 'lat-long
                              (:st-x 'geom) (:st-y 'geom)
                      :from 'employees
                      :left-join 'departments
                      :on (:= 'departments.department-id 'employees.department-id)
                      :where (:= 'employee-id 1))
                 'e)))

 (("{\"employee_id\":1,\"department_name\":\"spatial\",\"employee_name\":\"Maja\",\"start_date\":\"2018-09-02\",\"contact\":[\"084-767-734\",\"071-334-8473\"],\"lat_long\":\"(59.334591,18.06324)\",\"st_x\":59.334591,\"st_y\":18.06324}"))
#+end_src
Now the s-sql using the Postmodern :json-str keyword parameter for query:
#+begin_src lisp
  (query (:select 'employee-id (:as 'departments.name 'department-name)
                  (:as 'employees.name 'employee-name)
                  'start-date 'contact 'lat-long (:st-x 'geom) (:st-y 'geom)
          :from 'employees
          :left-join 'departments
          :on (:= 'departments.department-id 'employees.department-id)
          :where (:= 'employee-id 1))
         :json-str)
  "{\"employeeId\":1,\"departmentName\":\"spatial\",\"employeeName\":\"Maja\",\"startDate\":\"{2018-09-01T20:00:00.000000-04:00}\",\"contact\":[\"084-767-734\",\"071-334-8473\"],\"latLong\":[59.334591,18.06324],\"stX\":59.334591,\"stY\":18.06324}"
#+end_src

