doc/json-from-postgres.html

<div id="outline-container-s-sql-version" class="outline-2">
<h2 id="s-sql-version">The Basic S-SQL Version</h2>
<div class="outline-text-2" id="text-s-sql-version">
<p>
Assuming you already have a database to use, let's create a couple of tables and insert some data.
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (pomo:query (<span style="color: #23d7d7;">:create-table</span> 'departments
                             ((department-id <span style="color: #23d7d7;">:type</span> (or pomo:db-null bigint) <span style="color: #23d7d7;">:primary-key</span> t)
                              (name <span style="color: #23d7d7;">:type</span> (or pomo:db-null text)))))

  (pomo:query (<span style="color: #23d7d7;">:create-table</span> employees
                             ((employee_id <span style="color: #23d7d7;">:type</span> serial <span style="color: #23d7d7;">:primary-key</span> t)
                              (department_id <span style="color: #23d7d7;">:type</span> (or pomo:db-null integer) <span style="color: #23d7d7;">:references</span> ((departments department_id)))
                              (name <span style="color: #23d7d7;">:type</span> (or pomo:db-null text))
                              (start_date <span style="color: #23d7d7;">:type</span> (or pomo:db-null date))
                              (contact <span style="color: #23d7d7;">:type</span> (or pomo:db-null text[]))
                              (private <span style="color: #23d7d7;">:type</span> (or pomo:db-null text))
                              (lat_long <span style="color: #23d7d7;">:type</span> (or pomo:db-null point))
                              (geom <span style="color: #23d7d7;">:type</span> (or pomo:db-null (geometry point 4326))))))

  (pomo:query (<span style="color: #23d7d7;">:insert-rows-into</span> 'departments
               <span style="color: #23d7d7;">:columns</span> 'deparment-id 'name
               <span style="color: #23d7d7;">:values</span> '((1 <span style="color: #e67128;">"spatial"</span>) (2 <span style="color: #e67128;">"cloud"</span>))))

(pomo:sql (<span style="color: #23d7d7;">:insert-rows-into</span> 'employees
               <span style="color: #23d7d7;">:columns</span> 'department-id 'name 'start-date 'contact 'private 'lat_long 'geom
               <span style="color: #23d7d7;">:values</span>
         '((1 <span style="color: #e67128;">"Maja"</span>   <span style="color: #e67128;">"2018/09/02"</span> #(<span style="color: #e67128;">"084-767-734""071-334-8473"</span>) <span style="color: #e67128;">"not allowed"</span>
         <span style="color: #e67128;">"(59.334591, 18.063240)"</span> <span style="color: #e67128;">"POINT(59.334591 18.063240)"</span>)
         (1 <span style="color: #e67128;">"Liam"</span> <span style="color: #e67128;">"2019/09/02"</span> #(<span style="color: #e67128;">"084-767-734"</span> <span style="color: #e67128;">"071-334-8472"</span>) <span style="color: #e67128;">"private"</span>
         <span style="color: #e67128;">"(57.708870, 11.974560)"</span> <span style="color: #e67128;">"POINT(57.708870 11.974560)"</span>)
         (2 <span style="color: #e67128;">"Matteo"</span>  <span style="color: #e67128;">"2019/11/01"</span> #(<span style="color: #e67128;">"084-767-734""071-334-8476"</span>) <span style="color: #e67128;">"burn before reading"</span>
            <span style="color: #e67128;">"(58.28348912.285821)"</span> <span style="color: #e67128;">"POINT(58.283489 12.285821)"</span>)
         (2 <span style="color: #e67128;">"Astrid"</span>    <span style="color: #e67128;">"2020/10/01"</span>  #(<span style="color: #e67128;">"084-767-734""071-334-8465"</span>) <span style="color: #e67128;">"abandon all hope"</span>
            <span style="color: #e67128;">"(57.751442, 16.628838)"</span> <span style="color: #e67128;">"POINT(57.751442 16.628838)"</span>))))
</pre>
</div>
<p>
One difference to note is that the data for the lat_long point data type has a comma, but the geom geometry data type does not have a comma. No, I do not know why the syntax difference in Postgresql (Postmodern needs it to properly match Postgresql's syntax here).
</p>

<p>
I want to flag something that can surprise people. The lat_long column is a Postgresql point datatype. That means it is an array. As you may recall, Postgresql arrays start at 1, not 0. Except here. If you wanted just the latitude for the row with the employee_id of 1, you would actually call for array 0.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(pomo:query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:[]</span> 'lat_long 0) <span style="color: #23d7d7;">:from</span> 'employees <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'employee_id 1)) <span style="color: #23d7d7;">:single</span>)
59.334591d0
</pre>
</div>
<p>
If you wanted the latitude and longitude in alist, the query would look like:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(pomo:query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:[]</span> 'lat_long 0) (<span style="color: #23d7d7;">:[]</span> 'lat_long 1) <span style="color: #23d7d7;">:from</span> 'employees <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'employee_id 1)))
((59.334591d0 18.06324d0))
</pre>
</div>
<p>
If you ran a basic query to see how Postgresql was storing that geometry type, it would look something like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(pomo:query (<span style="color: #23d7d7;">:select</span> 'geom <span style="color: #23d7d7;">:from</span> 'employees <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'employee-id 1)) <span style="color: #23d7d7;">:single</span>)
  <span style="color: #e67128;">"0101000020E61000009A44BDE0D3AA4D408ECC237F30103240"</span>
</pre>
</div>
<p>
To actually get the separate latitude and longitude from the geom column, you need to use Postgresql functions st_x and st_y like so:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">with-connection</span> *dba-connection* (query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:st-x</span> 'geom) (<span style="color: #23d7d7;">:st-y</span> 'geom) <span style="color: #23d7d7;">:from</span> 'employees <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'employee_id 1))))
((59.334591d0 18.06324d0))
</pre>
</div>
<p>
Now on to getting this information as json. Postgresql gives you a json generator function that takes a tuple and returns a json dictionary. So, for example:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(pomo:query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:row-to-json</span> 'employees) <span style="color: #23d7d7;">:from</span> 'employees <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'employee-id 1)))
  ((<span style="color: #e67128;">"{\"employee_id\":1,</span>
<span style="color: #e67128;">      \"department_id\":1,</span>
<span style="color: #e67128;">      \"name\":\"Maja\",</span>
<span style="color: #e67128;">      \"start_date\":\"2018-09-02\",</span>
<span style="color: #e67128;">      \"contact\":[\"084-767-734\",\"071-334-8473\"],</span>
<span style="color: #e67128;">      \"private\":\"not allowed\",</span>
<span style="color: #e67128;">      \"lat_long\":\"(59.334591,18.06324)\",</span>
<span style="color: #e67128;">      \"geom\":{\"type\":\"Point\",\"coordinates\":[59.334591,18.06324]}}"</span>))
</pre>
</div>
<p>
You can see that it would automatically break out the geom data. However, as written, it has the fatal flaw of also collecting the private info. That can get solved with a slight modification:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:row-to-json</span> 'e)
        <span style="color: #23d7d7;">:from</span> (<span style="color: #23d7d7;">:as</span> (<span style="color: #23d7d7;">:select</span> 'employee-id 'department-id 'name 'start-date 'contact
                            'lat-long 'geom
                    <span style="color: #23d7d7;">:from</span> 'employees
                    <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'employee-id 1))
                   'e)))
((<span style="color: #e67128;">"{\"employee_id\":1,</span>
<span style="color: #e67128;">   \"department_id\":1,</span>
<span style="color: #e67128;">   \"name\":\"Maja\",</span>
<span style="color: #e67128;">   \"start_date\":\"2018-09-02\",</span>
<span style="color: #e67128;">   \"contact\":[\"084-767-734\",\"071-334-8473\"],</span>
<span style="color: #e67128;">   \"lat_long\":\"(59.334591,18.06324)\",</span>
<span style="color: #e67128;">   \"geom\":{\"type\":\"Point\",\"coordinates\":[59.334591,18.06324]}}"</span>))
</pre>
</div>
<p>
You can also aggregate rows using the Postgresql json_agg function.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:json-agg</span> 'e)
        <span style="color: #23d7d7;">:from</span> (<span style="color: #23d7d7;">:as</span> (<span style="color: #23d7d7;">:select</span> 'employee-id 'department-id 'name 'start-date 'contact
                            'lat-long 'geom
                    <span style="color: #23d7d7;">:from</span> 'employees)
                   'e)))
</pre>
</div>
<p>
You could skip the Postgresql json function and ask Postmodern to return the query as a json object expressed as a string. One thing to note is that Postmodern will return the labels as camelCase rather than Postgresql returning them as underscores:
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span style="color: #23d7d7;">:select</span> 'employee-id 'department-id 'name 'start-date 'contact 'lat-long 'geom
          <span style="color: #23d7d7;">:from</span> 'employees
          <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'employee-id 1)) <span style="color: #23d7d7;">:json-str</span>)

<span style="color: #e67128;">"{\"employeeId\":1,\"departmentId\":1,\"name\":\"Maja\",\"startDate\":\"{2018-09-01T20:00:00.000000-04:00}\",\"contact\":[\"084-767-734\",\"071-334-8473\"],\"latLong\":[59.334591,18.06324],\"geom\":\"0101000020E61000009A44BDE0D3AA4D408ECC237F30103240\"}"</span>
</pre>
</div>
<p>
You would need to do a little more work in order to get the desired latitude and longitude out of the geom value.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'employee-id 'department-id 'name 'start-date 'contact 'lat-long
                (<span style="color: #23d7d7;">:st-x</span> 'geom) (<span style="color: #23d7d7;">:st-y</span> 'geom)
                <span style="color: #23d7d7;">:from</span> 'employees
                <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'employee-id 1))
       <span style="color: #23d7d7;">:json-str</span>)
<span style="color: #e67128;">"{\"employeeId\":1,\"departmentId\":1,\"name\":\"Maja\",\"startDate\":\"{2018-09-01T20:00:00.000000-04:00}\",\"contact\":[\"084-767-734\",\"071-334-8473\"],\"latLong\":[59.334591,18.06324],\"stX\":59.334591,\"stY\":18.06324}"</span>
</pre>
</div>
<p>
Both the Postgresql function and the Postmodern return type approach can be applied to the end result of more complicated queries with joins, CTEs and other tools of the trade. Which is actually why we have the department table in this example. Instead of having the department-id in the json we are sending to the front end, let's have the department name.
</p>

<p>
First the s-sql using the Postgresql <code>row-to-json</code> function:
</p>
<div class="org-src-container">
<pre class="src src-lisp"> (query (<span style="color: #23d7d7;">:select</span> (<span style="color: #23d7d7;">:row-to-json</span> 'e)
         <span style="color: #23d7d7;">:from</span> (<span style="color: #23d7d7;">:as</span> (<span style="color: #23d7d7;">:select</span> 'employee-id (<span style="color: #23d7d7;">:as</span> 'departments.name 'department_name)
                             (<span style="color: #23d7d7;">:as</span> 'employees.name 'employee-name)
                             'start-date 'contact 'lat-long
                             (<span style="color: #23d7d7;">:st-x</span> 'geom) (<span style="color: #23d7d7;">:st-y</span> 'geom)
                     <span style="color: #23d7d7;">:from</span> 'employees
                     <span style="color: #23d7d7;">:left-join</span> 'departments
                     <span style="color: #23d7d7;">:on</span> (<span style="color: #23d7d7;">:=</span> 'departments.department-id 'employees.department-id)
                     <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'employee-id 1))
                'e)))

((<span style="color: #e67128;">"{\"employee_id\":1,\"department_name\":\"spatial\",\"employee_name\":\"Maja\",\"start_date\":\"2018-09-02\",\"contact\":[\"084-767-734\",\"071-334-8473\"],\"lat_long\":\"(59.334591,18.06324)\",\"st_x\":59.334591,\"st_y\":18.06324}"</span>))
</pre>
</div>
<p>
Now the s-sql using the Postmodern :json-str keyword parameter for query:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span style="color: #23d7d7;">:select</span> 'employee-id (<span style="color: #23d7d7;">:as</span> 'departments.name 'department-name)
                (<span style="color: #23d7d7;">:as</span> 'employees.name 'employee-name)
                'start-date 'contact 'lat-long (<span style="color: #23d7d7;">:st-x</span> 'geom) (<span style="color: #23d7d7;">:st-y</span> 'geom)
        <span style="color: #23d7d7;">:from</span> 'employees
        <span style="color: #23d7d7;">:left-join</span> 'departments
        <span style="color: #23d7d7;">:on</span> (<span style="color: #23d7d7;">:=</span> 'departments.department-id 'employees.department-id)
        <span style="color: #23d7d7;">:where</span> (<span style="color: #23d7d7;">:=</span> 'employee-id 1))
       <span style="color: #23d7d7;">:json-str</span>)
<span style="color: #e67128;">"{\"employeeId\":1,\"departmentName\":\"spatial\",\"employeeName\":\"Maja\",\"startDate\":\"{2018-09-01T20:00:00.000000-04:00}\",\"contact\":[\"084-767-734\",\"071-334-8473\"],\"latLong\":[59.334591,18.06324],\"stX\":59.334591,\"stY\":18.06324}"</span>
</pre>
</div>
</div>
</div>
