doc/json-from-postgres.org
* The Basic Dao-class Version
:PROPERTIES:
:CUSTOM_ID: dao-class-version
:END:
Assuming you already have a database to use, let's create a couple of dao classes, their associated tables and insert some data. Assume we decide we want to keep the geom as a list of latitude and longitude in the geom slot. That means we need import and export functions.
#+begin_src lisp
  (defclass departments ()
    ((department-id :col-type serial :initarg :department-id :accessor department-id
                    :col-primary-key t)
     (name :col-type (or text pomo:db-null) :initarg :name :accessor name))
    (:metaclass pomo:dao-class))

  (pomo:execute (dao-table-definition 'departments))

  (defclass employees ()
    ((employee-id :col-type serial :initarg :employee-id :accessor employee-id
                  :col-primary-key t)
     (department-id :col-type integer :initarg :department-id :accessor department-id
                    :col-references ((departments department-id)))
     (name :col-type text :initarg name :accessor name)
     (start-date :col-type (or date pomo:db-null) :initarg start-date :accessor start-date)
     (contact :col-type (or pomo:db-null (array text)) :initarg contact :accessor contact)
     (private :col-type (or pomo:db-null text) :initarg private :accessor private)
     (lat-long :col-type (or pomo:db-null point) :initarg lat-long :accessor lat-long)
     (geom :col-type (or pomo:db-null (geometry point 4326)) :initarg geom :accessor geom
           :col-import geom->wkb-point))
    (:metaclass pomo:dao-class))

  ;; make-doa creates an instance of the dao and saves it in the database
  (pomo:make-dao 'departments :department-id 1 :name "spatial")
  (pomo:make-dao 'departments :department-id 2 :name "cloud")

  (pomo:make-dao 'employees :department-id 1 :name "Maja" :start-date "2018/09/02"
                            :contact #("084-767-734","071-334-8473")
                            :private "not allowed" :lat-long "(59.334591, 18.063240)"
                            :geom "POINT(59.334591 18.063240)")

  (pomo:make-dao 'employees :department-id 1 :name "Liam" :start-date "2019/09/02"
                            :contact #("084-767-734","071-334-8472")
                            :private "private" :lat-long "(57.708870, 11.974560)"
                            :geom "POINT((57.708870 11.974560)")

  (pomo:make-dao 'employees :department-id 2 :name "Matteo" :start-date "2019/11/01"
                            :contact #("084-767-734","071-334-8476")
                            :private "burn before reading" :lat-long "(58.283489, 12.285821)"
                            :geom "POINT(58.283489 12.285821)")

  (pomo:make-dao 'employees :department-id 2 :name "Astrid" :start-date "2020/10/01"
                            :contact #("084-767-734","071-334-8465")
                            :private "abandon all hope" :lat-long "(57.751442, 16.628838)"
                            :geom "POINT(57.751442 16.628838)")
           #+end_src
One difference to note is that the data for the lat_long point data type has a comma, but the geom geometry data type does not have a comma. No, I do not know why the syntax difference.

Now the problem. If you ran a basic query to see how Postgresql was storing that geometry type, it would look something like this:

#+begin_src lisp
  (pomo:query "select geom from employees where employee_id=1" :single)
"0101000020E61000009A44BDE0D3AA4D408ECC237F30103240"
#+end_src

We need import and export functions that implement the opengis specification in order to implement the import and export functions for the geom slot. See [[https://www.ogc.org/standards/sfs]]. Fortunately J.P. Larocue created the cl-wkb package (accessed via quicklisp with quickloading the
[[https://github.com/filonenko-mikhail/cl-ewkb][cl-ewkb system]]) and we can create an import function with a combination of using ironclad's hex-string-to-byte-array and cl-wkb's decode function. So let's do that.
#+begin_src lisp
  (defun geom->wkb-point (input)
    "Takes a hexstring that represents a geometry point from postgresql and returns a cl-wkb:point class instance"
    (cl-wkb:decode (ironclad:hex-string-to-byte-array input)))
#+end_src
Now we can check whether we succeeded by seeing whether the x point is the latitude we expected:
#+begin_src lisp
  (cl-wkb:x (geom (pomo:get-dao 'employees 1)))
59.334591d0
#+end_src

We still need to get from the dao-class to json. You could do something like just run cl-json's =encode-json=function on a dao-object like so:
#+begin_src lisp
  (cl-json:encode-json (pomo:get-dao 'employees 1))

  {"employeeId":1,
   "departmentId":1,
   "name":"Maja",
   "startDate":{"day":6759,"sec":0,"nsec":0},
   "contact":["084-767-734","071-334-8473"],
   "private":"not allowed",
   "latLong":[59.334591,18.06324],
   "geom":{"geomtype":536870913,"srid":4326,"pointPrimitive":{"x":59.334591,"y":18.06324,"z":0.0,"m":0.0}}}
#+end_src
Looking at the result, we have two issues. First, the start date seems to have lost its senses. Second, it is collecting and passing on the private data to the front end, which we explicitly did not want to do.

Just checking on the date situation:
#+begin_src lisp
(start-date (pomo:get-dao 'employees 1)))
@2018-09-01T20:00:00.000000-04:00
#+end_src
That works, so it is something on the cl-json side that we will have to work around. Let's turn to the private data issue.

One solution would be to create a dao-class that is only a subset of the employees table (minus the private data) and set =pomo:*ignore-unknonw-columns*= to t. (If we did not set =pomo:*ignore-unknonw-columns*=, we would generate an error complaining that the dao
was not in sync with the table.) Let's do that:
#+begin_src lisp
    (defclass employees-minus-private ()
              ((employee-id :col-type serial :initarg :employee-id :accessor employee-id :col-primary-key t)
               (department-id :col-type integer :initarg :department-id :accessor department-id :col-references ((departments department-id)))
               (name :col-type text :initarg name :accessor name)
               (start-date :col-type (or date pomo:db-null) :initarg start-date :accessor start-date)
               (contact :col-type (or pomo:db-null (array text)) :initarg contact :accessor contact)
               (lat-long :col-type (or pomo:db-null point) :initarg lat-long :accessor lat-long)
               (geom :col-type (or pomo:db-null (geometry point 4326)) :initarg geom :accessor geom
                     :col-import geom->wkb-point))
              (:table-name employees)
              (:metaclass pomo:dao-class))

  (setf pomo:*IGNORE-UNKNOWN-COLUMNS* t)
   #+end_src
   And now cl-json generates a json string without the
   #+begin_src lisp
     (cl-json:encode-json (pomo:get-dao 'employees-minus-private 1))
     {"employeeId":1,"departmentId":1,"name":"Maja","startDate":3744835200,"contact":["084-767-734","071-334-8473"],"latLong":[59.334591,18.06324],"geom":{"geomtype":536870913,"srid":4326,"pointPrimitive":{"x":59.334591,"y":18.06324,"z":0.0,"m":0.0}}}
   #+end_src
If you are using a different CL json library, you would have to write your own functions to convert from a dao-class object to something that, e.g. jonathan or jsown could use.

Handling joins in a dao-class are more complicated - the Postmodern dao-class is intended to be simple, not recreate Hibernate or SQLAlchemy. You can see an example at [[https://marijnhaverbeke.nl/postmodern/dao-classes.html#multi-table-dao-class-object]].
