doc/json-from-postgres.html

<div id="outline-container-dao-class-version" class="outline-2">
<h2 id="dao-class-version">The Basic Dao-class Version</h2>
<div class="outline-text-2" id="text-dao-class-version">
<p>
Assuming you already have a database to use, let's create a couple of dao classes, their associated tables and insert some data. Assume we decide we want to keep the geom as a list of latitude and longitude in the geom slot. That means we need import and export functions.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">departments</span> ()
  ((department-id <span style="color: #23d7d7;">:col-type</span> serial <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:department-id</span> <span style="color: #23d7d7;">:accessor</span> department-id
                  <span style="color: #23d7d7;">:col-primary-key</span> t)
   (name <span style="color: #23d7d7;">:col-type</span> (or text pomo:db-null) <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:name</span> <span style="color: #23d7d7;">:accessor</span> name))
  (<span style="color: #23d7d7;">:metaclass</span> pomo:dao-class))

(pomo:execute (dao-table-definition 'departments))

(<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">employees</span> ()
  ((employee-id <span style="color: #23d7d7;">:col-type</span> serial <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:employee-id</span> <span style="color: #23d7d7;">:accessor</span> employee-id
                <span style="color: #23d7d7;">:col-primary-key</span> t)
   (department-id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:department-id</span> <span style="color: #23d7d7;">:accessor</span> department-id
                  <span style="color: #23d7d7;">:col-references</span> ((departments department-id)))
   (name <span style="color: #23d7d7;">:col-type</span> text <span style="color: #23d7d7;">:initarg</span> name <span style="color: #23d7d7;">:accessor</span> name)
   (start-date <span style="color: #23d7d7;">:col-type</span> (or date pomo:db-null) <span style="color: #23d7d7;">:initarg</span> start-date <span style="color: #23d7d7;">:accessor</span> start-date)
   (contact <span style="color: #23d7d7;">:col-type</span> (or pomo:db-null (array text)) <span style="color: #23d7d7;">:initarg</span> contact <span style="color: #23d7d7;">:accessor</span> contact)
   (private <span style="color: #23d7d7;">:col-type</span> (or pomo:db-null text) <span style="color: #23d7d7;">:initarg</span> private <span style="color: #23d7d7;">:accessor</span> private)
   (lat-long <span style="color: #23d7d7;">:col-type</span> (or pomo:db-null point) <span style="color: #23d7d7;">:initarg</span> lat-long <span style="color: #23d7d7;">:accessor</span> lat-long)
   (geom <span style="color: #23d7d7;">:col-type</span> (or pomo:db-null (geometry point 4326)) <span style="color: #23d7d7;">:initarg</span> geom <span style="color: #23d7d7;">:accessor</span> geom
         <span style="color: #23d7d7;">:col-import</span> geom-&gt;wkb-point))
  (<span style="color: #23d7d7;">:metaclass</span> pomo:dao-class))

<span style="color: #74af68;">;; </span><span style="color: #74af68;">make-doa creates an instance of the dao and saves it in the database</span>
(pomo:make-dao 'departments <span style="color: #23d7d7;">:department-id</span> 1 <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"spatial"</span>)
(pomo:make-dao 'departments <span style="color: #23d7d7;">:department-id</span> 2 <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"cloud"</span>)

(pomo:make-dao 'employees <span style="color: #23d7d7;">:department-id</span> 1 <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"Maja"</span> <span style="color: #23d7d7;">:start-date</span> <span style="color: #e67128;">"2018/09/02"</span>
                          <span style="color: #23d7d7;">:contact</span> #(<span style="color: #e67128;">"084-767-734"</span>,<span style="color: #e67128;">"071-334-8473"</span>)
                          <span style="color: #23d7d7;">:private</span> <span style="color: #e67128;">"not allowed"</span> <span style="color: #23d7d7;">:lat-long</span> <span style="color: #e67128;">"(59.334591, 18.063240)"</span>
                          <span style="color: #23d7d7;">:geom</span> <span style="color: #e67128;">"POINT(59.334591 18.063240)"</span>)

(pomo:make-dao 'employees <span style="color: #23d7d7;">:department-id</span> 1 <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"Liam"</span> <span style="color: #23d7d7;">:start-date</span> <span style="color: #e67128;">"2019/09/02"</span>
                          <span style="color: #23d7d7;">:contact</span> #(<span style="color: #e67128;">"084-767-734"</span>,<span style="color: #e67128;">"071-334-8472"</span>)
                          <span style="color: #23d7d7;">:private</span> <span style="color: #e67128;">"private"</span> <span style="color: #23d7d7;">:lat-long</span> <span style="color: #e67128;">"(57.708870, 11.974560)"</span>
                          <span style="color: #23d7d7;">:geom</span> <span style="color: #e67128;">"POINT((57.708870 11.974560)"</span>)

(pomo:make-dao 'employees <span style="color: #23d7d7;">:department-id</span> 2 <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"Matteo"</span> <span style="color: #23d7d7;">:start-date</span> <span style="color: #e67128;">"2019/11/01"</span>
                          <span style="color: #23d7d7;">:contact</span> #(<span style="color: #e67128;">"084-767-734"</span>,<span style="color: #e67128;">"071-334-8476"</span>)
                          <span style="color: #23d7d7;">:private</span> <span style="color: #e67128;">"burn before reading"</span> <span style="color: #23d7d7;">:lat-long</span> <span style="color: #e67128;">"(58.283489, 12.285821)"</span>
                          <span style="color: #23d7d7;">:geom</span> <span style="color: #e67128;">"POINT(58.283489 12.285821)"</span>)

(pomo:make-dao 'employees <span style="color: #23d7d7;">:department-id</span> 2 <span style="color: #23d7d7;">:name</span> <span style="color: #e67128;">"Astrid"</span> <span style="color: #23d7d7;">:start-date</span> <span style="color: #e67128;">"2020/10/01"</span>
                          <span style="color: #23d7d7;">:contact</span> #(<span style="color: #e67128;">"084-767-734"</span>,<span style="color: #e67128;">"071-334-8465"</span>)
                          <span style="color: #23d7d7;">:private</span> <span style="color: #e67128;">"abandon all hope"</span> <span style="color: #23d7d7;">:lat-long</span> <span style="color: #e67128;">"(57.751442, 16.628838)"</span>
                          <span style="color: #23d7d7;">:geom</span> <span style="color: #e67128;">"POINT(57.751442 16.628838)"</span>)
</pre>
</div>
<p>
One difference to note is that the data for the lat_long point data type has a comma, but the geom geometry data type does not have a comma. No, I do not know why the syntax difference.
</p>

<p>
Now the problem. If you ran a basic query to see how Postgresql was storing that geometry type, it would look something like this:
</p>

<div class="org-src-container">
<pre class="src src-lisp">  (pomo:query <span style="color: #e67128;">"select geom from employees where employee_id=1"</span> <span style="color: #23d7d7;">:single</span>)
<span style="color: #e67128;">"0101000020E61000009A44BDE0D3AA4D408ECC237F30103240"</span>
</pre>
</div>

<p>
We need import and export functions that implement the opengis specification in order to implement the import and export functions for the geom slot. See <a href="https://www.ogc.org/standards/sfs">https://www.ogc.org/standards/sfs</a>. Fortunately J.P. Larocue created the cl-wkb package (accessed via quicklisp with quickloading the
<a href="https://github.com/filonenko-mikhail/cl-ewkb">cl-ewkb system</a>) and we can create an import function with a combination of using ironclad's hex-string-to-byte-array and cl-wkb's decode function. So let's do that.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #ffad29; font-weight: bold;">defun</span> <span style="color: #00ede1; font-weight: bold;">geom-&gt;wkb-point</span> (input)
  <span style="color: #e67128;">"Takes a hexstring that represents a geometry point from postgresql and returns a cl-wkb:point class instance"</span>
  (cl-wkb:decode (ironclad:hex-string-to-byte-array input)))
</pre>
</div>
<p>
Now we can check whether we succeeded by seeing whether the x point is the latitude we expected:
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (cl-wkb:x (geom (pomo:get-dao 'employees 1)))
59.334591d0
</pre>
</div>

<p>
We still need to get from the dao-class to json. You could do something like just run cl-json's =encode-json=function on a dao-object like so:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(cl-json:encode-json (pomo:get-dao 'employees 1))

{<span style="color: #e67128;">"employeeId"</span><span style="color: #23d7d7;">:1</span>,
 <span style="color: #e67128;">"departmentId"</span><span style="color: #23d7d7;">:1</span>,
 <span style="color: #e67128;">"name"</span>:<span style="color: #e67128;">"Maja"</span>,
 <span style="color: #e67128;">"startDate"</span><span style="color: #23d7d7;">:{</span><span style="color: #e67128;">"day"</span><span style="color: #23d7d7;">:6759</span>,<span style="color: #e67128;">"sec"</span><span style="color: #23d7d7;">:0</span>,<span style="color: #e67128;">"nsec"</span><span style="color: #23d7d7;">:0}</span>,
 <span style="color: #e67128;">"contact"</span><span style="color: #23d7d7;">:[</span><span style="color: #e67128;">"084-767-734"</span>,<span style="color: #e67128;">"071-334-8473"</span>],
 <span style="color: #e67128;">"private"</span>:<span style="color: #e67128;">"not allowed"</span>,
 <span style="color: #e67128;">"latLong"</span><span style="color: #23d7d7;">:[59.334591</span>,18.06324],
 <span style="color: #e67128;">"geom"</span><span style="color: #23d7d7;">:{</span><span style="color: #e67128;">"geomtype"</span><span style="color: #23d7d7;">:536870913</span>,<span style="color: #e67128;">"srid"</span><span style="color: #23d7d7;">:4326</span>,<span style="color: #e67128;">"pointPrimitive"</span><span style="color: #23d7d7;">:{</span><span style="color: #e67128;">"x"</span><span style="color: #23d7d7;">:59.334591</span>,<span style="color: #e67128;">"y"</span><span style="color: #23d7d7;">:18.06324</span>,<span style="color: #e67128;">"z"</span><span style="color: #23d7d7;">:0.0</span>,<span style="color: #e67128;">"m"</span><span style="color: #23d7d7;">:0.0}}}</span>
</pre>
</div>
<p>
Looking at the result, we have two issues. First, the start date seems to have lost its senses. Second, it is collecting and passing on the private data to the front end, which we explicitly did not want to do.
</p>

<p>
Just checking on the date situation:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(start-date (pomo:get-dao 'employees 1)))
@2018-09-01T20:00:00.000000-04:00
</pre>
</div>
<p>
That works, so it is something on the cl-json side that we will have to work around. Let's turn to the private data issue.
</p>

<p>
One solution would be to create a dao-class that is only a subset of the employees table (minus the private data) and set <code>pomo:*ignore-unknonw-columns*</code> to t. (If we did not set <code>pomo:*ignore-unknonw-columns*</code>, we would generate an error complaining that the dao
was not in sync with the table.) Let's do that:
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (<span style="color: #ffad29; font-weight: bold;">defclass</span> <span style="color: #34cae2;">employees-minus-private</span> ()
            ((employee-id <span style="color: #23d7d7;">:col-type</span> serial <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:employee-id</span> <span style="color: #23d7d7;">:accessor</span> employee-id <span style="color: #23d7d7;">:col-primary-key</span> t)
             (department-id <span style="color: #23d7d7;">:col-type</span> integer <span style="color: #23d7d7;">:initarg</span> <span style="color: #23d7d7;">:department-id</span> <span style="color: #23d7d7;">:accessor</span> department-id <span style="color: #23d7d7;">:col-references</span> ((departments department-id)))
             (name <span style="color: #23d7d7;">:col-type</span> text <span style="color: #23d7d7;">:initarg</span> name <span style="color: #23d7d7;">:accessor</span> name)
             (start-date <span style="color: #23d7d7;">:col-type</span> (or date pomo:db-null) <span style="color: #23d7d7;">:initarg</span> start-date <span style="color: #23d7d7;">:accessor</span> start-date)
             (contact <span style="color: #23d7d7;">:col-type</span> (or pomo:db-null (array text)) <span style="color: #23d7d7;">:initarg</span> contact <span style="color: #23d7d7;">:accessor</span> contact)
             (lat-long <span style="color: #23d7d7;">:col-type</span> (or pomo:db-null point) <span style="color: #23d7d7;">:initarg</span> lat-long <span style="color: #23d7d7;">:accessor</span> lat-long)
             (geom <span style="color: #23d7d7;">:col-type</span> (or pomo:db-null (geometry point 4326)) <span style="color: #23d7d7;">:initarg</span> geom <span style="color: #23d7d7;">:accessor</span> geom
                   <span style="color: #23d7d7;">:col-import</span> geom-&gt;wkb-point))
            (<span style="color: #23d7d7;">:table-name</span> employees)
            (<span style="color: #23d7d7;">:metaclass</span> pomo:dao-class))

(setf pomo:*IGNORE-UNKNOWN-COLUMNS* t)
</pre>
</div>
<p>
And now cl-json generates a json string without the
</p>
<div class="org-src-container">
<pre class="src src-lisp">(cl-json:encode-json (pomo:get-dao 'employees-minus-private 1))
{<span style="color: #e67128;">"employeeId"</span><span style="color: #23d7d7;">:1</span>,<span style="color: #e67128;">"departmentId"</span><span style="color: #23d7d7;">:1</span>,<span style="color: #e67128;">"name"</span>:<span style="color: #e67128;">"Maja"</span>,<span style="color: #e67128;">"startDate"</span><span style="color: #23d7d7;">:3744835200</span>,<span style="color: #e67128;">"contact"</span><span style="color: #23d7d7;">:[</span><span style="color: #e67128;">"084-767-734"</span>,<span style="color: #e67128;">"071-334-8473"</span>],<span style="color: #e67128;">"latLong"</span><span style="color: #23d7d7;">:[59.334591</span>,18.06324],<span style="color: #e67128;">"geom"</span><span style="color: #23d7d7;">:{</span><span style="color: #e67128;">"geomtype"</span><span style="color: #23d7d7;">:536870913</span>,<span style="color: #e67128;">"srid"</span><span style="color: #23d7d7;">:4326</span>,<span style="color: #e67128;">"pointPrimitive"</span><span style="color: #23d7d7;">:{</span><span style="color: #e67128;">"x"</span><span style="color: #23d7d7;">:59.334591</span>,<span style="color: #e67128;">"y"</span><span style="color: #23d7d7;">:18.06324</span>,<span style="color: #e67128;">"z"</span><span style="color: #23d7d7;">:0.0</span>,<span style="color: #e67128;">"m"</span><span style="color: #23d7d7;">:0.0}}}</span>
</pre>
</div>
<p>
If you are using a different CL json library, you would have to write your own functions to convert from a dao-class object to something that, e.g. jonathan or jsown could use.
</p>

<p>
Handling joins in a dao-class are more complicated - the Postmodern dao-class is intended to be simple, not recreate Hibernate or SQLAlchemy. You can see an example at <a href="https://marijnhaverbeke.nl/postmodern/dao-classes.html#multi-table-dao-class-object">https://marijnhaverbeke.nl/postmodern/dao-classes.html#multi-table-dao-class-object</a>.
</p>
</div>
</div>
</div>
</body>
</html>
